[
  {
    "date":  "2022-04-13",
    "text": "Nathaniel successfully defended his Ph.D. dissertation, &ldquo;Smart Decision-Making via Edge Intelligence for Smart Cities&rdquo;. He will be joining the University of Chicago as a postdoctoral scholar in August. Congratulations, Nathaniel!"
  },
  {
    "date": "2022-04-11",
    "text": "Our paper on smart traffic light control using edge computing and federated reinforcement learning has been accepted for publication in IEEE SMARTCOMP 2022"},
  {
    "date": "2021-10-13",
    "text": "Our work on QoS-aware, priority-based offloading in edge systems has been accepted for publication through the IEEE CCNC 2022 conference."
  },
  {
    "date": "2021-08-23",
    "text": "Minoo gave a talk at the ACM SIGCOMM 2021 Networking Networking Women (N2Women) workshop on her research, &ldquo;Optimal Task Offloading for Deep Learning Services in Edge-Enabled Systems: An Accuracy-Time Trade-off&rdquo;."
  },
  {
    "date": "2021-08-15",
    "text": "Dr. Khamfroush and Nathaniel will travel to Porto, Portugal to give a joint talk on their research, &ldquo;Edge intelligence for deep learning services&ldquo;."
  },
  {
    "date": "2021-06-23",
    "text": "We are thrilled to welcome our new Ph.D. student to the Net-Science lab. Welcome to the team, Afsaneh!"
  },
  {
    "date": "2021-05-01",
    "text": "Minoo and Nathaniel have both been awarded NSF travel grants to attend this year's INFOCOM conference. Congratulations!"
  },
  {
    "date": "2021-04-27",
    "text": "Minoo successfully passed her depth exam requirement as part of her Ph.D. program. Keep up the good work, Minoo!"
  },
  {
    "date": "2021-04-23",
    "text": "Our papers entitled &ldquo;A Framework for Edge Intelligent Smart Distribution Grids via Federated Learning&rdquo; and &ldquo;QoS-Aware Placement of Deep Learning Services on the Edge with Multiple Service Implementations&rdquo; have been accepted for publication in the main track and the big data and machine learning for networking workshop track in the 2021 IEEE ICCCN conference, respectively."
  },
  {
    "date": "2021-03-30",
    "text": "Both Minoo and Nathaniel have been awarded student travel grants, funded by the NSF, to attend the IEEE INFOCOM 2021 conference."
  },
  {
    "date": "2021-03-24",
    "text": "Dr. Khamfroush was the winner of the 2021 Sarah Bennet Holmes Award, which is bestowed upon University of Kentucky employees who have achieved professional and personal success while promoting the growth and well-being of women at the University of Kentucky and beyond."
  },
  {
    "date": "2021-03-23",
    "text": "Nathaniel's paper on behavioral information diffusion was awarded the UK CS departmental award for 2020 outstanding paper. Keep up the great work, Nathaniel!"
  },
  {
    "date": "2021-01-25",
    "text": "Congratulations to Minoo, Andrew, and Dr. Khamfroush on their recently-accepted paper on request offloading in edge computing systems for ICC 2021!"
  },
  {
    "date": "2020-12-18",
    "text": "Dr. Khamfroush's paper on service placement and request scheduling has been accepted for publication in the IEEE/ACM Transactions on Networking."
  },
  {
    "date": "2020-10-18",
    "text": "Nathaniel and Dr. Khamfroush's journal paper on behavioral information diffusion in online social networks has been accepted for publication in the IEEE Transactions on Network Science and Engineering!"
  },
  {
    "date": "2020-09-19",
    "text": "A paper co-authored by Minoo, Nathaniel, and Dr. Khamfroush on latency/accuracy trade-off of deep learning models on the edge has been accepted for publication for IEEE GLOBECOM's 2020 Workshop series."
  },
  {
    "date": "2020-09-08",
    "text": "Nathaniel received the NSF student travel grant for the 2020 SMARTCOMP conference."
  },
  {
    "date": "2020-08-26",
    "text": "Minoo and Dr. Khamfroush's paper on edge layer optimization has been accepted for the SmartGridComm 2020 conference."
  },
  {
    "date": "2020-07-28",
    "text": "Dr. Khamfroush is serving on ACM/IEEE SEC 2020 TPC, submit your work <a target='_blank' href='https://acm-ieee-sec.org/2020/'>here</a>."
  },
  {
    "date": "2020-07-28",
    "text": "Dr. Khamfroush is serving on IEEE INFOCOM 2021 TPC, submit your work <a target='_blank' href='https://infocom2021.ieee-infocom.org'>here</a>."
  },
  {
    "date": "2020-07-28",
    "text": "Dr. Khamfroush is serving on IEEE ICFEC 2021 TPC, submit your work <a target='_blank' href='https://icfec2021.eeecs.qub.ac.uk'>here</a>."
  },
  {
    "date": "2020-07-28",
    "text": "Dr. Khamfroush has been designated to serve as the co-advisor of ACM-W at the University of Kentucky."
  },
  {
    "date": "2020-06-24",
    "text": "Dr. Khamfroush has been elevated to IEEE Senior member grade!"
  },
  {
    "date": "2020-06-24",
    "text": "Dr. Khamfoush is serving on <a target='_blank' href='https://globecom2020.ieee-globecom.org'>IEEE GLOBECOM 2020</a> TPC"
  },
  {
    "date": "2020-06-24",
    "text": "Dr. Khamfroush is serving on <a target='_blank' href='https://ieee-wf-5g.org'>IEEE 5G World Forum 2020</a> TPC"
  },
  {
    "date": "2020-06-24",
    "text": "Dr. Khamfroush is serving on <a target='_blank' href='https://www.ieeelcn.org'>LCN 2020</a> TPC"
  },
  {
    "date": "2020-06-24",
    "text": "Dr. Khamfroush is serving on <a target='_blank' href='http://www.icdcn2021.net'>ICDCN</a> 2021 TPC"
  },
  {
    "date": "2020-06-24",
    "text": "Dr. Khamfroush is co-chair of IEEE SmartGridComm, Workshop on Edge Computing for Smart Grids. To submit your papers: <a target='_blank' href='https://sgc2020.ieee-smartgridcomm.org/workshop/ws-3-edge-computing-smart-grids'>[Click Here]</a>."
  },
  {
    "date": "2020-06-08",
    "text": "Dr. Khamfroush was selected as the recipient of a CS Department 50th Anniversary Junior Faculty Fellowship. This is a three-year endowed fellowship that she will be able to use to enhance her research activities."
  },
  {
    "date": "2020-04-20",
    "text": "Matthew successfully defended his master's thesis on QoS-aware service placement/scheduling in edge cloud systems. Congratulations, Matthew!"
  },
  {
    "date": "2020-04-10",
    "text": "Nathaniel's paper on smart advertisement and click optimization has been accepted for publication through the SMARTCOMP 2020 conference. Congratulations, Nathaniel!"
  },
  {
    "date": "2020-02-24",
    "text": "Aram has been accepted as an incoming doctoral student to the Department of Computer Science and will officially join our lab as a full-time PhD student in the fall. Congratulations, Aram!"
  },
  {
    "date": "2020-01-23",
    "text": "Our team just received a research grant for two-years from NSF to study the use of federated learning for resource management in edge computing. <a target='_blank' href='https://www.nsf.gov/awardsearch/showAward?AWD_ID=1948387'>[X]</a>"
  },
  {
    "date": "2020-01",
    "text": "We received support for a one-year project from Cisco to do research on the use of network coding in mobile edge computing."
  },
  {
    "date": "2019-11-26",
    "text": "Nathaniel was awarded two travel awards to attend to the WINE 2019 conference in New York City!"
  },
  {
    "date": "2019-10-20",
    "text": "I am invited to give a talk at the University of Central Florida on Nov. 22nd!"
  },
  {
    "date": "2019-10",
    "text": "Minoo is awarded a travel grant from the NSF to present her research on edge computing in the 4th ACM/IEEE symposium on Edge computing (SEC) 2019! Congratulations Minoo, great start!"
  },
  {
    "date": "2019-10-8",
    "text": "Two papers accepted at the ICNC 2020! Congratulations to Emory and Matthew for their great research work."
  },
  {
    "date": "2019-10-15",
    "text": "Nathaniel won the runner-up award for his poster on click-through predicition on online social networks, presented at the CCS summit 2019. Congratulations Nathaniel!"
  },
  {
    "date": "2019-08",
    "text": "I am organizing a workshop on Edge Computing for Cyber Physical Systems at IEEE GLOBECOM 2019, Hawaii, USA! Submit your papers here: <a target='_blank' href='https://globecom2019.ieee-globecom.org/workshop/ws-14-edge-computing-cyber-physical-systems-edge-cps'>Submission</a>."
  },
  {
    "date": "2019-08",
    "text": "I am invited to serve as a TPC member at INFOCOM 2020!"
  },
  {
    "date": "2019-08",
    "text": "Jack won the runner up outstanding research award for his summer research with us, presented at the summer research program! Congratulations Jack!"
  },
  {
    "date": "2019-07",
    "text": "Research Grant awarded! Delighted to announce that our research proposal has been funded! We will investigate Measles disease in Collaboration with my colleague from public health department, at the University of Kentucky!"
  },
  {
    "date": "2019-05",
    "text": "I was named “a teacher who made a difference” at the University of Kentucky, April 2019."
  },
  {
    "date": "",
    "text": "I am invited to serve on the Editorial board of PLOS ONE journal!"
  },
  {
    "date": "",
    "text": "I received a travel grant to attend NSF Career Workshop in Alexandria, VA April 2018."
  },
  {
    "date": "",
    "text": "So excited to announce that two PhD students join NetScience lab: Nathaniel Hudson and Matthew Turner just joined the NetScience lab! Welcome to the group."
  },
  {
    "date": "",
    "text": "TPC member IEEE LCN 2018!"
  },
  {
    "date": "2018-02",
    "text": "I will attend TRIWiC!"
  },
  {
    "date": "",
    "text": "Got a grant to attend Women in CyberSecurity (WiCys)"
  },
  {
    "date": "",
    "text": "TPC member GLOBECOM 2018"
  },
  {
    "date": "",
    "text": "TPC member IFIP WWIC 2018"
  },
  {
    "date": "",
    "text": "TPC member IFIP /networking 2018"
  },
  {
    "date": "",
    "text": "I will attend CyberW workshop in Dallas!"
  },
  {
    "date": "",
    "text": "TPC member EWSN 2018"
  },
  {
    "date": "",
    "text": "TPC member ICC 2018"
  },
  {
    "date": "",
    "text": "TPC member LCN 2017"
  }
]